# -*- coding: utf-8 -*-
# @USER: CarryChang

# 设置词典大小为 n_features
n_features = 3000

# 存储断句的文件夹
sentence_cut_path = 'data/sentence_cut.txt'

# 主题句文件夹
topic_path = 'topic_text'

# 基于字典的查找
#景区
topic_words_list = {
       '卫生': {'卫生', '整洁','味道','垃圾','干净','空气','环境','保洁','垃圾桶','环保','臭','脏乱','脏','打扫','清理'},
    '性价比': {'优惠','学生证','雨衣','票价','值得一去','值得一看','物超所值','豪华','价格', '房价', '性价比', '价位', '单价'
    ,'便宜','价钱','性价比','免费','门票'},
    '设施': {'公交','配套','更衣室','温泉','游船','缆车','窗口','设施','过山车','火车','水上','餐厅','摆锤','巴士','游乐场'},
    '位置': {'拥堵','周边','不吵','商场','视野','交通', '车程', '地段', '路程', '停车', '机场', '离', '车站', '地理', '位置', '中心', '海拔', '码头','地铁站','靠近','附近','旁边','火车站','东站'},
    '服务': {'学生证','寄存','退房','接机','接送','专车','贴心','服务', '态度', '前台', '服务员', '老板', '掌柜', '店家', '工作人员','小姐姐','小哥哥','热情','周到','耐心','优质','宾至如归','取票'}
}

#酒店时使用以下词
#topic_words_list = {
#    '卫生': {'卫生', '周边', '干净', '浴缸', '街', '周围', '房间', '整洁', '大堂','客房','马桶','床垫','厕所','阳台','床单','卫生间','味道'},
 #   '性价比': {'物超所值','豪华','价格', '房价', '性价比', '价位', '单价', '价钱','性价比','免费',''},
  #  '设施': {'泡温泉','齐全','隔音','上档次','厕所','空调','车位','健身房','电梯','床垫','停车场','设施', '设备', '条件', '硬件', '房间', '热水', '马桶', '电梯', '阳台', '卫生间', '洗手间', '空调', '被子', '床', '大厅', '电话', '电', '摆设','游泳池','装修'},
  #  '位置': {'周边','不吵','商场','视野','交通', '车程', '地段', '路程', '停车', '机场', '离', '车站', '地理', '位置', '中心', '海拔', '码头','地铁站','靠近','附近','旁边','火车站','东站',''},
  #  '服务': {'退房','接机','接送','专车','贴心','服务', '态度', '前台', '服务员', '老板', '掌柜', '店家', '工作人员','小姐姐','小哥哥','升级','热情','周到','耐心','优质','宾至如归',''},
#}





# 存储情感极性的图
topic_emotion_pic = 'topic_emotion_pic'

# 最大句子长度
maxlen = 100

# 最大的tokenizer字典长度
max_words = 1000

# 设置embedding大小
embedding_dim = 300

# train_method : 模型训练方式，textcnn
train_method = 'textcnn'

# 模型的保存位置，后续用于推理
sa_model_path_m = 'model_saved/model.h5'

# 离线保存tokenizer
tokenize_path = 'model_saved/tokenizer.pickle'